[
    {
        "key": "proop",
        "name": "Partha Roop",
        "photo": "https://unidirectory.auckland.ac.nz/people/imageraw/p-roop/10290280/biggest",
        "position": "Associate Professor",
        "role": "leader",
        "contact": {
            "phone": "+64 9 923 5583",
            "fax": "+64 9 373 7461",
            "email": "p.roop@auckland.ac.nz",
            "unidirectory": "https://unidirectory.auckland.ac.nz/profile/p-roop"
        },
        "info": {
            "background": "Partha Roop is the Computer Systems Engineering programme director in the Department of Electrical and Computer Engineering at the University of Auckland, New Zealand. He completed his PhD in Computer Science and Engineering at the University of New South Wales, Sydney, Australia, a M.Tech at Indian Institute of Technology in Kharagpur, India and a BE degree at Anna University (College of Engineering), Madras, India. Partha had visiting positions in Kiel University, Germany (collaboration with the <a href=\"http://www.rtsys.informatik.uni-kiel.de/en\" target=\"blank\">Embedded Systems Group</a>, French National Laboratory of Informatics and Control (<a href=\"https://team.inria.fr/spades/\" target=\"blank\">SPADES team Grenoble</a>), and <a href=\"http://www.ece.iastate.edu\" target=\"_blank\">Iowa State University</a>. He collaborates with University of California, Berkeley in the <a href=\"https://chess.eecs.berkeley.edu/pret/\" target=\"blank\">PRET project</a>.",
            "research_interests": "<ul><li>Real-Time Systems</li><li>Computer Engineering for Biological Systems (cyber-biological systems)</li><li>Software Engineering for web / cloud services</li><li>Medical Devices</li><li>Heart Modelling and Pacemakers</li><li>Intelligent Transportation Systems</li><li>Industrial Automation.</li></ul>"
        }
    },
    {
        "key": "amal",
        "name": "Avinash Malik",
        "photo": "https://unidirectory.auckland.ac.nz/people/imageraw/avinash-malik/10399875/biggest",
        "position": "Lecturer",
        "role": "member",
        "contact": {
            "phone": "+64 9 923 9231",
            "email": "avinash.malik@auckland.ac.nz",
            "unidirectory": "https://unidirectory.auckland.ac.nz/profile/avinash-malik"
        },
        "info": {
            "background": "Avinash obtained his BE (Hons I) and PhD from the University of Auckland in 2010. He then worked as a post-doctoral fellow at INRIA Grenoble, the French Institute for Research in Computer Science and Automation. His work as a post-doctoral fellow continued at Trinity College Dublin, Ireland in the department of computer science and statistics, after which he then took a role as a research scientist at IBM Research. He joined the University of Auckland in May 2013.",
            "research_interests": "<ul><li>Real-time systems</li><li>Embedded systems</li><li>Compiler construction</li><li>Programming language semantics</li><li>Logic for program verification</li><li>Formal methods application to bioengineering</li></ul>"
        }
    },
    {
        "key": "lyoo",
        "name": "Li Hsien Yoong",
        "photo": "",
        "role": "alumni",
        "contact": {
        },
        "info": {
        }
    },
    {
        "key": "zbha",
        "name": "Zeeshan Ejaz Bhatti",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/picture-281x300.jpg",
        "role": "alumni",
        "contact": {
        },
        "info": {
            "background": "Zeeshan holds a Bachelor’s degree in Software Engineering complemented with a 4 year experience in the software industry. He went on to get two Master’s degrees in Computer Science and Software Engineering. He is currently working towards his Ph.D. degree in Computer Systems Engineering and his research work is on developing software engineering tools for functional safety of programmable electronic systems.",
            "research_interests": "Software Engineering: Formal Methods, Tools and Practices.<br /><br />Safety Critical Systems: Deterministic Execution, Code Generation.<br /><br />Functional Safety: Qualitative and Quantitative Analysis"
        }
    },
    {
        "key": "mkuo",
        "name": "Matthew Kuo",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/matthew1-247x300.jpg",
        "position": "PhD Student",
        "role": "member",
        "contact": {
            "email": "mkuo005@aucklanduni.ac.nz"
        },
        "info": {
            "background": "I am doctoral student in the department of Electrical and Computer Systems Engineering. I have received my BE also at the University of Auckland New Zealand.<br /><br />My hobbies are playing strategic board games such as Chess and Go.",
            "research_interests": "My research interests are hard-real time systems and timing predictable hardware architectures. In addition, I have great interest in cyber physical systems such as augmented and virtual reality systems."
        }
    },
    {
        "key": "hpea",
        "name": "Hammond Pearce",
        "photo": "",
        "position": "PhD Student",
        "role": "member",
        "contact": {
            "email": "hpea485@aucklanduni.ac.nz"
        },
        "info": {
        }
    },
    {
        "key": "nall",
        "name": "Nathan Allen",
        "photo": "",
        "position": "PhD Student",
        "role": "member",
        "contact": {
            "email": "nall426@aucklanduni.ac.nz"
        },
        "info": {
        }
    },
    {
        "key": "sand",
        "name": "Sidharta Andalam",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/sid-Large-225x300.jpg",
        "position": "Postdoctoral Researcher",
        "role": "member",
        "contact": {
            "email": "sid.andalam@auckland.ac.nz"
        },
        "info": {
            "background": [
                "Sidharta Andalam is currently working on the Heart-on-FPGA research group in the Department of Electrical and Computer Engineering, University of Auckland. His principle research is on emulating the electrical conduction system of the heart for validation of medical devices such as cardiac pacemakers.",
                "Sidharta Andalam received his Ph.D from University of Auckland in 2013, where his thesis focused on developing a predictable platform for safety-critical systems. During his Ph.D., he has worked with University of California, Berkeley on Precision Timed (PRET) processors. He has worked at INRIA, France on language semantics, abstract interpretation and static analysis and worked at Christian-Albrechts-University, Kiel, Germany on designing and analysis of reactive processors. Furthermore, he enjoys collabration with the members of Advanced Formal Methods for Embedded Systems (AFMES) program, supported by INRIA, France and with the members of Center for Hybrid and Embedded Software Systems (Chess) at University of California, Berkeley. His research was focused on designing synchronous languages, time predictable reactive processors and developed a model checking based timing analyser for verifying timing constraints.  He has developed new techniques for statically analysing caches and scratchpads for computing an upper bound on the worst case execution time of a program. Furthermore, Sidharta developed reactive processors for executing synchronous languages called Esterel and PRET-C, and worked on FPGA based hardware accelerators for reducing the worst case execution time of a program while maintaining predictability.",
                "In 2014-15, Sidharta Andalam worked as a research fellow in embedded systems group at TUM CREATE, Singapore. TUM CREATE is a research programme for developing innovative technologies, for design and application of electric vehicles (EVs). He researched on design, implementation and analysis of safety-critical automotive applications. Using a time triggered Ethernet, he investigated task distribution and migration in heterogeneous multi-core architecture."
            ]
        }
    },
    {
        "key": "mhik",
        "name": "Mahmood Hikmet",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/moody1.jpg",
        "position": "PhD Student",
        "role": "member",
        "contact": {
            "email": "mhik003@aucklanduni.ac.nz"
        },
        "info": {
            "background": "Born in Iraq in 1989, and moved to New Zealand in 1996. Grew up in East Auckland. I’ve been using computers since before I could walk – I learned how to push the power button on computers before my father learned how to frequently save his projects. I graduated with a Bachelor’s Degree in Computer System Engineering in 2012 from the University of Auckland. I am currently sponsored by HMI Technologies where I also work as a Research and Development Engineer.",
            "research_interests": "Vehicular communication (vehicle to vehicle and vehicle to infrastructure). Particularly the specific protocols used for communication with an interest in introducing safety and robustness so services using the protocols are more reliable and dependable. I am interested in a model-driven approach to the problem."
        }
    },
    {
        "key": "jro",
        "name": "Jin Ro",
        "photo": "",
        "position": "PhD Student",
        "role": "member",
        "contact": {
            "email": "jro002@aucklanduni.ac.nz"
        },
        "info": {
        }
    },
    {
        "key": "eyip",
        "name": "Eugene Yip",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/Eugene-Yip.jpg",
        "role": "alumni",
        "contact": {
            "email": "eyip002@aucklanduni.ac.nz"
        },
        "info": {
            "background": [
                "Eugene Yip received his undergraduate degree in Engineering (Hons) from the University of Auckland. He is currently a Doctoral Candidate, supervised by Dr. Partha Roop and Dr. Morteza Biglari-Abhari. His primary field of interest is in the deterministic parallel programming of embedded multicore systems with safety-critical concerns. He is developing a synchronous extension to C with formal semantics, called ForeC, which allows programmers to write deterministic parallel programs. To complement the language, he is also developing a static timing analysis tool for computing WCRT of ForeC programs executed on multicore systems. He has served as a teaching assistant in the software design and digital logic courses, and a student mentoring scheme.",
                "Eugene is interested in website development and opensource projects. He has been involved in Spark, which is a student-led organisation for fostering the spirit of entrepreneurship at the University of Auckland. He has also tried Salsa, Ceroc, and enjoys Ballroom dancing. To keep his writing fluent, he enjoys the use of fountain pens."
            ]
        }
    },
    {
        "key": "jwan",
        "name": "Hugh Wang",
        "photo": "",
        "position": "PhD Student",
        "role": "member",
        "contact": {
            "email": "jwan232@aucklanduni.ac.nz"
        },
        "info": {
            "background": "I am a PhD student in the Department of Electrical and Computer Engineering at the University of Auckland in Auckland, New Zealand, supervised by Dr. Partha S. Roop. I also obtained my Master of Engineering (Honours) degree and B.E. (Honours) degree at the same university.",
            "research_interests": [
                "My main research interest is in the area of real-time embedded system.",
                "The research topic of the master is ILP based WCRT analysis for synchronous programs. The ILP formulations explicitly take the concurrent and the lock-step execution natural of synchronous programs into consideration, result a faster analysis time than conventional ILP formulation and better handling of the state space explosion problem. My current research focus on how to effectively program Precision Timed (PRET) Machines with consideration of facilitating the timing analysis process and achieving optimal performance."
            ]
        }
    },
    {
        "key": "sali",
        "name": "Adeel Ali",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/adeel-Large-200x300.jpg",
        "role": "alumni",
        "contact": {
            "email": "sali080@aucklanduni.ac.nz"
        },
        "info": {
            "background": "Born in Karachi, Pakistan, 18th Nov 1982. Graduated (with Distinction) in 2006 from NED University of Engineering & Technology (Department of Computer Science and Information Technology), Karachi, Pakistan. Worked at VoiZar MFZ LLC www.voizar.com (formerly VoIPDeal) between 2006 and 2008, and left as a Software Engineer. Completed Masters of Engineering (First Class Honors) from The University Of Auckland (Electrical And Computer Engineering Department) in Nov 2009.",
            "research_interests": "Internet based Services (Web, Mobile, Cloud). Service Oriented Activities esp. Service Composition. Formal Methods Application for Service Oriented Computing."
        }
    },
    {
        "key": "rsin",
        "name": "Roopak Sinha",
        "photo": "http://pretzel.ece.auckland.ac.nz/wp-uploads/2013/02/roopak.jpg",
        "role": "external",
        "contact": {
            "email": "r.sinha@auckland.ac.nz"
        },
        "info": {
            "education": "Postgraduate Certificate in Academic Practice, University of Auckland, Expected completion: November 2013<br />Doctor of Philosophy (PhD), Electrical and Computer Engineering, University of Auckland, 2009<br />Bachelor of Engineering (1st class Honours), Electronics and Computer Engineering, Manukau Institute of Technology, 2003",
            "research_interests": "Internet based Services (Web, Mobile, Cloud). Service Oriented Activities esp. Service Composition. Formal Methods Application for Service Oriented Computing."
        }
    }
]
